01  REG-CLIENTE.
           05 CLI-ID-TXT        PIC 9(05).
           05 CLI-NOME-TXT      PIC X(32).
           05 CLI-SALDO-TXT     PIC 9(07).
           