01  REG-TRANSACAO.
           05 TRX-CLI-ID-TXT    PIC 9(05).
           05 TRX-ID-TXT        PIC 9(05).
           05 TRX-TIPO-TXT      PIC X(01).
           05 TRX-VALOR-TXT     PIC 9(09).
           